---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NoSupportKCoefficientTable
source: html/4ffce2fe-7d21-1782-2533-7a2cd2254009.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NoSupportKCoefficientTable Property

"K Coefficient from table" is not supported on connector for the element

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSupportKCoefficientTable { get; }
```